# User query to Graph Schema attribute mapping
BUSSINESS_MAPPING = {
    "账簿": ["凭证.账簿"],
    "期间": ["凭证.期间", "余额.期间"],
    "应付账款": ["科目.名称=应付账款"],
    "应付职工薪酬": ["科目.名称=应付职工薪酬"],
    "部门": ["凭证.核算维度.部门.名称", "人员.部门"],
    "客户": ["客户.客户名称", "凭证.核算维度.客户.名称", "凭证.客户编码"],
    "凭证": ["凭证"],
    "数外凭证": ["凭证.来源系统", "凭证.来源类型"],
    "银行存款": ["科目.名称=银行存款"],
    "支出": ["凭证.贷方", "余额.本期发生额.贷方金额"],  # 特指支付/流出方向
    "余额": [
        "余额.期初余额.借方金额",
        "余额.期初余额.贷方金额",
        "余额.期末余额.借方金额",
        "余额.期末余额.贷方金额"
    ],
    "发生额": [
        "余额.本期发生额.借方金额",
        "余额.本期发生额.贷方金额",
        "凭证.借方",
        "凭证.贷方"
    ],
    "科目": ["科目.名称", "凭证.科目名称"],
    "明细科目": ["科目.名称", "凭证.科目全名"],
    "明细账": ["凭证", "科目"],
    "第一维度编码": ["科目.编码"]
}

MAX_CONTEXT_WINDOW = 20
