# User query to Graph Schema attribute mapping
BUSSINESS_MAPPING = {
    "账簿": [
        "账簿.名称"
    ],
    "期间": [
        "期间.名称",
        "期间.年份",
        "期间.期数"
    ],
    "应付账款": [
        "科目.科目名称",
        "科目.科目编码"
    ],
    "发生额": [
        "科目余额.本期发生额_借方金额",
        "科目余额.本期发生额_贷方金额"
    ],
    "职工薪酬": [
        "费用.名称",
        "费用.费用id"
    ],
    "部门": [
        "部门.名称",
        "部门.部门编码"
    ],
    "客户": [
        "客户.客户名称",
        "客户.客户编码"
    ],
    "往来": [
        "凭证.核算维度_客户_名称",
        "凭证.核算维度_客户_编码"
    ],
    "银行存款": [
        "科目.科目名称",
        "科目.科目编码"
    ],
    "数外凭证": [
        "凭证.凭证号",
        "凭证.uid"
    ],
    "支出变化": [
        "科目余额.本期发生额_借方金额",
        "科目余额.本期发生额_贷方金额"
    ],
    "明细科目余额": [
        "科目余额.科目名称",
        "科目余额.科目编码",
        "科目余额.期末余额_借方金额",
        "科目余额.期末余额_贷方金额"
    ],
    "存款余额变化": [
        "科目余额.期初余额_借方金额",
        "科目余额.期末余额_借方金额"
    ],
    "环比变化": [
        "科目余额.本期发生额_借方金额",
        "科目余额.上期发生额_借方金额"
    ],
    "科目": [
        "科目.科目名称",
        "科目.科目编码"
    ],
    "第一维度编码": [
        "余额.第一维度编码"
    ],
    "凭证记录": [
        "凭证.凭证号",
        "凭证.uid"
    ]
}

MAX_CONTEXT_WINDOW = 20
